case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha.water 0//only air in the domain
    volVectorFieldValue U (0 0 0) // reset velocity in the whole domain
    volScalarFieldValue p_rgh 0//
);

regions
(
    sphereToCell
    {
        centre (0 0 0.0031);
        radius 0.003;
        fieldValues
        (
            volScalarFieldValue alpha.water 1//we set our sphere of water into the domain
            volVectorFieldValue U (0 0 -1) //JM: This is the initial velocity of the droplet, an estimate of its free-fall terminal velocity
        );
    }
);


// ************************************************************************* //
